InformationRegisters/СвязанныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеРаботы</Name>
			<Comment>Связанные работы и детали для авторабот</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязаннаяРабота</Name>
					<Comment>Связанная авторабота или номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество, переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Автоработы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Автоработы</Name>
			<Comment>Автоработы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидНормировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_СложностьРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_СложностьРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОкраска</Name>
					<Comment>Это окраска</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеПредложение</Name>
					<Comment>Признак того что эта авторабота является дополнительным предложением</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьДанныеВЗаявкеНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нормочас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПакетДляКомплектации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормыРасходаМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/OPCode/Ext/Module.bsl
Функция OpCodeGet(OPCodeGetRequest)
	// в запросе передаётся: DMSROID, DMSRONo, Model код модели) и Description (строка поиска)
	OpCodeGetType = ФабрикаXDTO.Тип("http://wa.dms.webservice/OPCodeGetRequest", "OPCodeGetResponse");
	OpCodeGet = ФабрикаXDTO.Создать(OpCodeGetType);   
	
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));
	
    Попытка
		НомерЗаказНаряда = OPCodeGetRequest.OPCodeGet.DMSRONo;
	Исключение
		НомерЗаказНаряда = "";
	КонецПопытки;       
	Попытка
		IDЗаказНаряда = OPCodeGetRequest.OPCodeGet.DMSROID;
	Исключение
		IDЗаказНаряда = "";
	КонецПопытки; 
	Если ЗначениеЗаполнено(IDЗаказНаряда) Тогда
		Попытка
			ID = Новый УникальныйИдентификатор(IDЗаказНаряда);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "OCG01";
			НоваяСтрока.ТекстОшибки = "Некорректный ID Заказ-наряда";
			OPCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest",OPCodeGetRequest,OPCodeGet,"-1",ТаблицаОщибок);
			Возврат OPCodeGet;  		
		КонецПопытки;		
		ЗаказНарядСсылка = Документы.ЗаказНаряд.ПолучитьСсылку(ID);
    	Если ЗаказНарядСсылка.ПолучитьОбъект() = Неопределено Тогда		
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "OCG01";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным идентификатором не найден";
			OPCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest",OPCodeGetRequest,OPCodeGet,"-1",ТаблицаОщибок);
			Возврат OPCodeGet;  		
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НомерЗаказНаряда) Тогда
		ЗаказНарядСсылка = Документы.ЗаказНаряд.НайтиПоНомеру(НомерЗаказНаряда, ТекущаяДата());
    	Если обЗначениеНеЗаполнено(ЗаказНарядСсылка) Тогда		
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "OCG01";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным номером не найден";
			OPCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest",OPCodeGetRequest,OPCodeGet,"-1",ТаблицаОщибок);
			Возврат OPCodeGet;  		
		КонецЕсли;		
	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "OCG01";
		НоваяСтрока.ТекстОшибки = "Не указаны номер и ID Заказ-наряда";
		OPCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest",OPCodeGetRequest,OPCodeGet,"-1",ТаблицаОщибок);
		Возврат OPCodeGet;  		
	КонецЕсли;
	
	Попытка
		ОписаниеРаботы = OPCodeGetRequest.OPCodeGet.Description;
	Исключение
		ОписаниеРаботы = "";
	КонецПопытки;     	
	Если ЗначениеЗаполнено(ОписаниеРаботы) Тогда
		Если СтрДлина(ОписаниеРаботы) < 3 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "OCG02";
			НоваяСтрока.ТекстОшибки = "Для поиска по фрагменту описания работы должно быть не менее 3 символов";
			OPCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest",OPCodeGetRequest,OPCodeGet,"-1",ТаблицаОщибок);
			Возврат OPCodeGet;   
		КонецЕсли;    
	КонецЕсли;
	
    Попытка
		МодельКод = OPCodeGetRequest.OPCodeGet.Model; // код модели автомобиля
	Исключение
		МодельКод = "";
	КонецПопытки;
	Если ЗначениеЗаполнено(МодельКод) Тогда
		//МодельСсылка = Справочники.Модели.НайтиПоКоду("ЦБ00003644/" + МодельКод, Истина);
		ГруппаХендэ = Справочники.Модели.НайтиПоКоду("ЦБ00003644");
		Если ЗначениеЗаполнено(ГруппаХендэ) Тогда
			МодельСсылка = Справочники.Модели.НайтиПоРеквизиту("КодМодели", МодельКод, ГруппаХендэ);
		Иначе
			МодельСсылка = Справочники.Модели.НайтиПоРеквизиту("КодМодели", МодельКод);
		КонецЕсли;
		//Если обЗначениеНеЗаполнено(МодельСсылка) Тогда
		//	НоваяСтрока = ТаблицаОщибок.Добавить();
		//	НоваяСтрока.Код = "WA03";
		//	НоваяСтрока.ТекстОшибки = "Модель автомобиля с указанным кодом не найдена";
		//	PackageCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest",OPCodeGetRequest,OPCodeGet,"-1",ТаблицаОщибок);
		//	Возврат PackageCodeGet;      
		//КонецЕсли;
	Иначе
		МодельСсылка = Справочники.Модели.ПустаяСсылка();
	КонецЕсли;
	
	Попытка
		Двигатель = OPCodeGetRequest.OPCodeGet.Engine;
	Исключение
		Двигатель = "";
	КонецПопытки;   		
	//Если ЗначениеЗаполнено(Двигатель) Тогда 
	//	ДвигательСсылка = Справочники.ТипыДвигателей.НайтиПоКоду(Двигатель);
	//	Если обЗначениеНеЗаполнено(ДвигательСсылка) Тогда
	//		НоваяСтрока = ТаблицаОщибок.Добавить();
	//		НоваяСтрока.Код = "WA03";
	//		НоваяСтрока.ТекстОшибки = "Некорректный код типа двигателя";
	//		PackageCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest",OPCodeGetRequest,OPCodeGet,"-1",ТаблицаОщибок);
	//		Возврат PackageCodeGet;      
	//	КонецЕсли;       
	//КонецЕсли;     
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ОписаниеРаботы", "%" + ОписаниеРаботы + "%");
	Если ЗначениеЗаполнено(МодельСсылка) Тогда
		Запрос.Параметры.Вставить("МодельСсылка", МодельСсылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	АвтоработыНормыВремени.Ссылка КАК Ссылка,
		               |	АвтоработыНормыВремени.Ссылка.Код КАК Код,
		               |	АвтоработыНормыВремени.Ссылка.Артикул КАК Артикул,
		               |	АвтоработыНормыВремени.Ссылка.Наименование КАК Наименование,
		               |	АвтоработыНормыВремени.ВремяВыполнения КАК ВремяВыполнения
		               |ИЗ
		               |	Справочник.Автоработы.НормыВремени КАК АвтоработыНормыВремени
		               |ГДЕ
		               |	АвтоработыНормыВремени.Модель = &МодельСсылка
		               |	И АвтоработыНормыВремени.ВремяВыполнения > 0
					   |	" + ?(ЗначениеЗаполнено(ОписаниеРаботы), "И АвтоработыНормыВремени.Ссылка.Наименование ПОДОБНО &ОписаниеРаботы", "");
		
	ИначеЕсли ЗначениеЗаполнено(ОписаниеРаботы) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Автоработы.Ссылка КАК Ссылка,
		               |	Автоработы.Код КАК Код,
		               |	Автоработы.Артикул КАК Артикул,
		               |	Автоработы.Наименование КАК Наименование,
		               |	Автоработы.ВремяВыполнения КАК ВремяВыполнения
		               |ИЗ
		               |	Справочник.Автоработы КАК Автоработы
		               |ГДЕ
		               |	Автоработы.ВремяВыполнения > 0
		               |	И НЕ Автоработы.ЭтоГруппа
		               |	И Автоработы.Наименование ПОДОБНО &ОписаниеРаботы";
	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Не задано ни одного параметра для поиска!";
		PackageCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest", OPCodeGetRequest, OPCodeGet, "-1", ТаблицаОщибок);
		Возврат PackageCodeGet;      
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Количество()=0 Тогда                         		
		OPCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest", OPCodeGetRequest, OPCodeGet, "0", ТаблицаОщибок);
		Возврат OPCodeGet;  
	Иначе   		
		OpCodesType = ФабрикаXDTO.Тип("http://wa.dms.webservice/OPCodeGetRequest", "ArrayOfOPCode");
		OpCodes = ФабрикаXDTO.Создать(OpCodesType); 	
		OPCodeType = ФабрикаXDTO.Тип("http://wa.dms.webservice/OPCodeGetRequest", "OPCode");     		
		Пока Выборка.Следующий() Цикл
			OpCode = ФабрикаXDTO.Создать(OPCodeType); 
			OpCode.Code = Выборка.Код;
			OpCode.Description = Выборка.Наименование;
			OpCode.OPCodeType = ?(обЗначениеНеЗаполнено(Выборка.Артикул),"2","1");
			OpCode.DisplayOPCode = Выборка.Код;
			OpCode.DisplayOPDescription = Выборка.Наименование;
			OpCode.Make = "";
			OpCode.Model = "";			
			OpCode.Engine = "";
			OpCode.Year = "";
			OpCode.Mileage = "";
			OpCode.Period = "";
			OpCode.DefLinePaymentMethod = "";
			OpCode.CorrectionLOP = "";
			OpCode.SkillLevel = "";			
			OpCode.HazardMaterialCharge = "";
			
			ВремяВыполнения = Выборка.ВремяВыполнения;
			OpCode.EstimatedHours = Формат(ВремяВыполнения,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
			OpCode.PredefinedCauseDescription = "";
			OpCode.CPSIND = "";  	
			OpCode.MandatoryYN = "";
			
			PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/OPCodeGetRequest", "PriceType");
			Price = ФабрикаXDTO.Создать(PriceType);
			Если ЗначениеЗаполнено(МодельСсылка) Тогда
				НормочасЦенаСтр = орПолучитьЦенуАвтоработы(Справочники.ТипыЦен.ОсновнойТипЦенПродажи, Выборка.Ссылка,
					МодельСсылка, ЗаказНарядСсылка.ДоговорВзаиморасчетов, ЗаказНарядСсылка.Цех, ЗаказНарядСсылка.ВидРемонта);	
				НормочасЦена = НормочасЦенаСтр.Цена;       				
				Price.UnitPrice = Формат(НормочасЦена*ВремяВыполнения,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				Price.TotalPrice = Формат(НормочасЦена*ВремяВыполнения,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				Price.TotalPriceIncludeTax = Формат(НормочасЦена*ВремяВыполнения,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				Price.DiscountRate = "0";
				Price.DiscountPrice = "0";  
			КонецЕсли;          
			OpCode.PriceType = Price;
			
			PartsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/OPCodeGetRequest", "ArrayOfPart");
			Parts = ФабрикаXDTO.Создать(PartsType);

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	СвязанныеРаботы.Авторабота,
			               |	СвязанныеРаботы.СвязаннаяРабота,
			               |	СвязанныеРаботы.Количество
			               |ИЗ
			               |	РегистрСведений.СвязанныеРаботы КАК СвязанныеРаботы
			               |ГДЕ
			               |	СвязанныеРаботы.Авторабота = &Работа
			               |	И ТИПЗНАЧЕНИЯ(СвязанныеРаботы.СвязаннаяРабота) = ТИП(Справочник.Номенклатура)";
			
			Запрос.Параметры.Вставить("Работа", Выборка.Ссылка);
			Выб = Запрос.Выполнить().Выбрать();
			Если Выб.Количество() > 0 Тогда
				Пока Выб.Следующий() Цикл
					Номенклатура = Выб.СвязаннаяРабота;
					PartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/OPCodeGetRequest", "Part");
					Part = ФабрикаXDTO.Создать(PartType);
					Part.Manufacturer = "";
					Part.PartNumber = Номенклатура.Артикул; 
					Part.PartDescription = Номенклатура.Наименование; 
					Part.Make = "";
					Part.PartStatus = ""; 
					Part.PartType = ?(Номенклатура.Код = Номенклатура.Артикул, "2", "1");
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ВЫБОР
					               |		КОГДА ОстаткиТоваровКомпанииОстатки.КоличествоОстаток ЕСТЬ NULL
					               |			ТОГДА 0
					               |		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0)
					               |	КОНЕЦ КАК СвободныйОстаток,
					               |	ЦеныСрезПоследних.Цена КАК Цена
					               |ИЗ
					               |	РегистрСведений.Цены.СрезПоследних(
					               |			,
					               |			Номенклатура = &Номенклатура
					               |				И ПодразделениеКомпании = &Подразделение
					               |				И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
					               |				,
					               |				СкладКомпании.Подразделение = &Подразделение
					               |					И Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки
					               |		ПО ЦеныСрезПоследних.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура";
																							 
					Запрос.Параметры.Вставить("ТипЦен", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
					Запрос.Параметры.Вставить("Номенклатура", Номенклатура);
					Запрос.Параметры.Вставить("Подразделение", ЗаказНарядСсылка.ПодразделениеКомпании);

					Выбор = Запрос.Выполнить().Выбрать();
					Если Выбор.Следующий() Тогда
						UnitPrice = Выбор.Цена;
						Part.QuantityOnHand = Формат(Выбор.СвободныйОстаток, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0");
						Part.StockQuantity = ?(Выбор.СвободныйОстаток > 0, "Y", "N");
						//Part.StockStatus = Формат(Выбор.СвободныйОстаток - Выбор.ЗначениеРеквизита, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");					
						Part.StockStatus = Формат(Выбор.СвободныйОстаток, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0");					
					Иначе        		
						UnitPrice = 0;
						Part.QuantityOnHand = "0";
						Part.StockQuantity = "N";
						Part.StockStatus = "";
					КонецЕсли;  					
		
					Part.DisplayPartNumber = Номенклатура.Артикул; 
					Part.Remarks = "";    					
					Part.UnitOfMeasure = Номенклатура.ОсновнаяЕдиницаИзмерения.Наименование;
					Part.Quantity = Формат(Выб.Количество, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0");
					Part.ServiceType = ""; 
					Part.DisplayRemarks = "";
					Part.MandatoryYN = "";  
					
					PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/OPCodeGetRequest", "PriceType");
					Price = ФабрикаXDTO.Создать(PriceType);
					//UnitPrice = обПолучитьЦену(Справочники.ТипыЦен.НайтиПоКоду("ЦБ000005"), Номенклатура);
					//Если обЗначениеНеЗаполнено(UnitPrice) Тогда
					//	UnitPrice = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенПродажи, Номенклатура);
					//КонецЕсли;   						
					Price.UnitPrice = Формат(UnitPrice, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=");
					Price.TotalPrice = Формат(UnitPrice * Выб.Количество, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=");
					Price.TotalPriceIncludeTax = Формат(UnitPrice * Выб.Количество, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=");
					Price.DiscountRate = "0";
					Price.DiscountPrice = "0";  
					         
					Part.PriceType = Price;   							
                    Parts.Part.Добавить(Part);
				КонецЦикла;   
			КонецЕсли;			   
			OpCode.Parts = Parts;			
			OpCodes.OpCode.Добавить(OpCode);
		КонецЦикла;
    КонецЕсли;    		

    OpCodeGet.OpCodes = OpCodes;
	OPCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/OPCodeGetRequest",OPCodeGetRequest,OPCodeGet,"1",ТаблицаОщибок);
	Возврат OPCodeGet; 
КонецФункции
